Revit 2024 API
StairsPathType.ArrowheadTypeId Property
 The arrow head type of the stairs path.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public ElementId ArrowheadTypeId { get; set; }
Visual Basic
Public Property ArrowheadTypeId As ElementId
	Get
	Set
Visual C++
public:
property ElementId^ ArrowheadTypeId {
	ElementId^ get ();
	void set (ElementId^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: The arrowheadTypeId is not a valid arrow head type.
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
StairsPathType Class
Autodesk.Revit.DB.Architecture Namespace